#include <iostream>
using namespace std;

//template--> function && class
// templete هو عبارة عن اشي جاهز بستقبل مني كلاس معين هاد الكلاس هو الليب حدد ايش نع الداتا تايب اللي رح اتعامل معها 


//1. template function

template<class T, class T1>//==> محل كل int بحط t 
//CLSS T IS ABOUT a specific data type

T1 add(T a, T1 b)
{
    return a + b;
}

int main()
{
    // لما اتعامل مه كلاس واجد من التيمبليت لازم كلهم يكونوا من نفس النوع
    //كل فنكشن انلو تيمبليت لحالو بس لما بدي اتعامل مع اكتر من داتا تايب لازم اضيف اكتر من تيمبليت
    //او a و الاشي الراجع من نفس النوع يعني بالمختصر انا اللي بتحكم و بحدد النوع لازم بي و الاشي الراجع من نفس النوع
    double a = 9;// لو حكيت الداتا تايب هون دبل و بالتيمبليت حطيت int حينفذ اللي بالتيمبليت لاو اقوى التيمبليت 
    double b = 8;
  cout<< add<int , double>( a + b);


}

